EnmanuelParache/msp430fr247x/msp430fr2476.svd
<?xml version="1.0" encoding="UTF-8"?>
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
  <vendor>msp430gen</vendor>
  <name>MSP430FR2476</name>
  <version>v0.4.0-22-g754f7f3</version>
  <description></description>
  <addressUnitBits>8</addressUnitBits>
  <width>16</width>
  <size>16</size>
  <access>read-write</access>
  <resetValue>0</resetValue>
  <peripherals>
    <peripheral>
      <name>P1</name>
      <description>P1</description>
      <baseAddress>512</baseAddress>
      <registers>
        <register>
          <name>P1IN</name>
          <description>Port 1 Input</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P1OUT</name>
          <description>Port 1 Output</description>
          <addressOffset>2</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P1DIR</name>
          <description>Port 1 Direction</description>
          <addressOffset>4</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P1REN</name>
          <description>Port 1 Resistor Enable</description>
          <addressOffset>6</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P1SEL0</name>
          <description>Port 1 Select 0</description>
          <addressOffset>10</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P1SEL1</name>
          <description>Port 1 Select 1</description>
          <addressOffset>12</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P1SELC</name>
          <description>Port 1 Complement Select</description>
          <addressOffset>22</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P1IES</name>
          <description>Port 1 Interrupt Edge Select</description>
          <addressOffset>24</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P1IE</name>
          <description>Port 1 Interrupt Enable</description>
          <addressOffset>26</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P1IFG</name>
          <description>Port 1 Interrupt Flag</description>
          <addressOffset>28</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P1IV</name>
          <description>Port 1 Interrupt Vector Register</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>P1IV</name>
              <description>Port 1 interrupt vector value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1IFG0</name>
                  <description>Interrupt Source: Port 1.0 interrupt; Interrupt Flag: P1IFG0; Interrupt Priority: Highest</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1IFG1</name>
                  <description>Interrupt Source: Port 1.1 interrupt; Interrupt Flag: P1IFG1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1IFG2</name>
                  <description>Interrupt Source: Port 1.2 interrupt; Interrupt Flag: P1IFG2</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1IFG3</name>
                  <description>Interrupt Source: Port 1.3 interrupt; Interrupt Flag: P1IFG3</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1IFG4</name>
                  <description>Interrupt Source: Port 1.4 interrupt; Interrupt Flag: P1IFG4</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1IFG5</name>
                  <description>Interrupt Source: Port 1.5 interrupt; Interrupt Flag: P1IFG5</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1IFG6</name>
                  <description>Interrupt Source: Port 1.6 interrupt; Interrupt Flag: P1IFG6</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1IFG7</name>
                  <description>Interrupt Source: Port 1.7 interrupt; Interrupt Flag: P1IFG7; Interrupt Priority: Lowest</description>
                  <value>16</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>P2</name>
      <description>P2</description>
      <baseAddress>512</baseAddress>
      <registers>
        <register>
          <name>P2IN</name>
          <description>Port 2 Input</description>
          <addressOffset>1</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P2OUT</name>
          <description>Port 2 Output</description>
          <addressOffset>3</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P2DIR</name>
          <description>Port 2 Direction</description>
          <addressOffset>5</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P2REN</name>
          <description>Port 2 Resistor Enable</description>
          <addressOffset>7</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P2SEL0</name>
          <description>Port 2 Select 0</description>
          <addressOffset>11</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P2SEL1</name>
          <description>Port 2 Select 1</description>
          <addressOffset>13</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P2SELC</name>
          <description>Port 2 Complement Select</description>
          <addressOffset>23</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P2IES</name>
          <description>Port 2 Interrupt Edge Select</description>
          <addressOffset>25</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P2IE</name>
          <description>Port 2 Interrupt Enable</description>
          <addressOffset>27</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P2IFG</name>
          <description>Port 2 Interrupt Flag</description>
          <addressOffset>29</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P2IV</name>
          <description>Port 2 Interrupt Vector Register</description>
          <addressOffset>30</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>P2IV</name>
              <description>Port 2 interrupt vector value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P2IFG0</name>
                  <description>Interrupt Source: Port 2.0 interrupt; Interrupt Flag: P2IFG0; Interrupt Priority: Highest</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P2IFG1</name>
                  <description>Interrupt Source: Port 2.1 interrupt; Interrupt Flag: P2IFG1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P2IFG2</name>
                  <description>Interrupt Source: Port 2.2 interrupt; Interrupt Flag: P2IFG2</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P2IFG3</name>
                  <description>Interrupt Source: Port 2.3 interrupt; Interrupt Flag: P2IFG3</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P2IFG4</name>
                  <description>Interrupt Source: Port 2.4 interrupt; Interrupt Flag: P2IFG4</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P2IFG5</name>
                  <description>Interrupt Source: Port 2.5 interrupt; Interrupt Flag: P2IFG5</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P2IFG6</name>
                  <description>Interrupt Source: Port 2.6 interrupt; Interrupt Flag: P2IFG6</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P2IFG7</name>
                  <description>Interrupt Source: Port 2.7 interrupt; Interrupt Flag: P2IFG7; Interrupt Priority: Lowest</description>
                  <value>16</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
