EnmanuelParache/msp430fr247x/msp430fr2476.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PMM</name>
      <description>PMM</description>
      <baseAddress>288</baseAddress>
      <registers>
        <register>
          <name>PMMCTL0</name>
          <description>Power Management Module control register 0</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>PMMSWBOR</name>
              <description>Software brownout reset.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PMMSWBOR_0</name>
                  <description>Normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMMSWBOR_1</name>
                  <description>Set to 1 to trigger a BOR</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMMSWPOR</name>
              <description>Software POR.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PMMSWPOR_0</name>
                  <description>Normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMMSWPOR_1</name>
                  <description>Set to 1 to trigger a POR</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMMREGOFF</name>
              <description>Regulator off</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PMMREGOFF_0</name>
                  <description>Regulator remains on when going into LPM3 or LPM4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMMREGOFF_1</name>
                  <description>Regulator is turned off when going to LPM3 or LPM4. System enters LPM3.5 or LPM4.5, respectively.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SVSHE</name>
              <description>High-side SVS enable.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SVSHE_0</name>
                  <description>High-side SVS (SVSH) is disabled in LPM2, LPM3, LPM4, LPM3.5, and LPM4.5. SVSH is always enabled in active mode, LPM0, and LPM1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVSHE_1</name>
                  <description>SVSH is always enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMMPW</name>
              <description>PMM password.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>PMMPWR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>PASSWORD</name>
                  <description>Values always reads from the PMMCTL0 register</description>
                  <value>150</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>PMMPWW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>PASSWORD</name>
                  <description>Values which must be written to the PMMCTL0 register</description>
                  <value>165</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PMMCTL1</name>
          <description>Power Management Module Control Register 1. Allows manual overwrite of predictive LDO settings.</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>PMMCTL2</name>
          <description>Power Management Module Control Register 2</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>INTREFEN</name>
              <description>Internal reference enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTREFEN_0</name>
                  <description>Disable internal reference</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTREFEN_1</name>
                  <description>Enable internal reference</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTREFEN</name>
              <description>External reference output enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXTREFEN_0</name>
                  <description>Disable external reference output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTREFEN_1</name>
                  <description>Enable internal reference output</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRMODE</name>
              <description>Power Mode Selection. The two bits are used to select the power supply in multi power supply systems. A single power supply system is not affected by the bits. Reserved for future use.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSENSOREN</name>
              <description>Temperature sensor enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSENSOREN_0</name>
                  <description>Disable temperature sensor</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSENSOREN_1</name>
                  <description>Enable temperature sensor</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFGENACT</name>
              <description>Reference generator active. Read only.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REFGENACT_0</name>
                  <description>Reference generator not active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFGENACT_1</name>
                  <description>Reference generator active</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFBGACT</name>
              <description>Reference bandgap active. Ready only.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REFBGACT_0</name>
                  <description>Reference bandgap buffer not active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFBGACT_1</name>
                  <description>Reference bandgap buffer active</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BGMODE</name>
              <description>Bandgap mode. Ready only.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BGMODE_0</name>
                  <description>Static mode (higher precision)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BGMODE_1</name>
                  <description>Sampled mode (lower power consumption)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFGENRDY</name>
              <description>Variable reference voltage ready status.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REFGENRDY_0</name>
                  <description>Reference voltage output is not ready to be used.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFGENRDY_1</name>
                  <description>Reference voltage output is ready to be used</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFBGRDY</name>
              <description>Buffered bandgap voltage ready status.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REFBGRDY_0</name>
                  <description>Buffered bandgap voltage is not ready to be used</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFBGRDY_1</name>
                  <description>Buffered bandgap voltage is ready to be used</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFVSEL</name>
              <description>Reference voltage level select. Can be modified only when REFGENBUSY = 0.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REFVSEL_0</name>
                  <description>00b = 1.5V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFVSEL_1</name>
                  <description>01b = 2.0V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFVSEL_2</name>
                  <description>10b = 2.5V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFVSEL_3</name>
                  <description>11b = Reserved</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFGEN</name>
              <description>Reference generator one-time trigger. If written with a 1, the generation of the variable reference voltage is started. When the reference voltage request is set, this bit is cleared by hardware.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REFGEN_0</name>
                  <description>No trigger</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFGEN_1</name>
                  <description>Generation of the reference voltage is started by writing 1 or by a hardware trigger</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFBGEN</name>
              <description>Bandgap and bandgap buffer one-time trigger. If written with a 1, the generation of the buffered bandgap voltage is started. When the bandgap buffer voltage request is set, this bit is cleared by hardware.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REFBG_0</name>
                  <description>No trigger</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFBG_1</name>
                  <description>Generation of the bandgap voltage is started by writing 1 or by a hardware trigger</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PMMIFG</name>
          <description>PMM interrupt flag register</description>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>PMMBORIFG</name>
              <description>PMM software brownout reset interrupt flag.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PMMBORIFG_0</name>
                  <description>Reset not due to PMMSWBOR</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMMBORIFG_1</name>
                  <description>Reset due to PMMSWBOR</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMMRSTIFG</name>
              <description>PMM reset pin interrupt flag.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PMMRSTIFG_0</name>
                  <description>Reset not due to reset pin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMMRSTIFG_1</name>
                  <description>Reset due to reset pin</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMMPORIFG</name>
              <description>PMM software POR interrupt flag.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PMMPORIFG_0</name>
                  <description>Reset not due to PMMSWPOR</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMMPORIFG_1</name>
                  <description>Reset due to PMMSWPOR</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPWRIFG</name>
              <description>Secondary Power interrupt flag. This bit only works in multi power supply systems. When the secondary power is ready to use, this bit is set., In single power supply systems, this bit does not work.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SVSHIFG</name>
              <description>High-side SVS interrupt flag.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SVSHIFG_0</name>
                  <description>Reset not due to SVSH</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVSHIFG_1</name>
                  <description>Reset due to SVSH</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMMLPM5IFG</name>
              <description>LPMx.5 flag.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PMMLPM5IFG_0</name>
                  <description>Reset not due to wake-up from LPMx.5</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMMLPM5IFG_1</name>
                  <description>Reset due to wake-up from LPMx.5</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMMSPSIFG</name>
              <description>PMM secondary power supply interrupt flag. Reserved for future multi power supply systems.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PPWRIFG</name>
              <description>Primary Power interrupt flag. This bit only works in multi power supply systems. When the primary power is ready to use, this bit is set. In single power supply systems, this bit does not work</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PM5CTL0</name>
          <description>Power mode 5 control register 0</description>
          <addressOffset>16</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>LOCKLPM5</name>
              <description>LPMx.5 Lock Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCKLPM5_0</name>
                  <description>LPMx.5 configuration is not locked and defaults to its reset condition.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKLPM5_1</name>
                  <description>LPMx.5 configuration remains locked. Pin state is held during LPMx.5 entry and exit.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPM5SW</name>
              <description>Reports or sets the LPM3.5 switch connection upon the switch mode set by LPM5SM. When this bit is set, the VLPM3.5 domain can accept full-speed read and write operation by CPU MCLK. If the switch is disconnected, all peripherals within this domain can only accept the operation no more than 40 kHz. In automatic mode (LPM5SM = 0), this bit represents the switch connection between Vcore and VLPM3.5. Any write to this bit has no effect. In manual mode (LPM5SM = 1), this bit can be fully read and written by software. When this bit is set, the switch connection between Vcore and VLPM3.5 is connected. Otherwise, the switch is disconnected.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM5SW_0</name>
                  <description>LPMx.5 switch disconnected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM5SW_1</name>
                  <description>LPMx.5 switch connected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPM5SM</name>
              <description>Specifies the operation mode of the LPM3.5 switch.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM5SM_0</name>
                  <description>Automatic mode for LPM3.5 switch that the switch is fully handled by the circuitry during mode switch.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM5SM_1</name>
                  <description>Manual mode for LPM3.5 switch that the switch is specified by LPM5SW bit setting in software.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
