EnmanuelParache/msp430fr247x/msp430fr2476.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CRC</name>
      <description>CRC</description>
      <baseAddress>448</baseAddress>
      <registers>
        <register>
          <name>CRCDI</name>
          <description>CRC Data In</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>CRCDIRB</name>
          <description>CRC Data In Reverse Byte</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>CRCINIRES</name>
          <description>CRC Initialization and Result</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>CRCRESR</name>
          <description>CRC Result Reverse</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WDT_A</name>
      <description>WDT_A</description>
      <baseAddress>460</baseAddress>
      <registers>
        <register>
          <name>WDTCTL</name>
          <description>Watchdog Timer Control Register</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>WDTIS</name>
              <description>Watchdog timer interval select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2G</name>
                  <description>Watchdog clock source / (2^(31)) (18:12:16 at 32.768 kHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128M</name>
                  <description>Watchdog clock source /(2^(27)) (01:08:16 at 32.768 kHz)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8192K</name>
                  <description>Watchdog clock source /(2^(23)) (00:04:16 at 32.768 kHz)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512K</name>
                  <description>Watchdog clock source /(2^(19)) (00:00:16 at 32.768 kHz)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32K</name>
                  <description>Watchdog clock source /(2^(15)) (1 s at 32.768 kHz)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8192</name>
                  <description>Watchdog clock source / (2^(13)) (250 ms at 32.768 kHz)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512</name>
                  <description>Watchdog clock source / (2^(9)) (15.625 ms at 32.768 kHz)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <description>Watchdog clock source / (2^(6)) (1.95 ms at 32.768 kHz)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDTCNTCL</name>
              <description>Watchdog timer counter clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDTCNTCL_0</name>
                  <description>No action</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTCNTCL_1</name>
                  <description>WDTCNT = 0000h</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDTTMSEL</name>
              <description>Watchdog timer mode select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDTTMSEL_0</name>
                  <description>Watchdog mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTTMSEL_1</name>
                  <description>Interval timer mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDTSSEL</name>
              <description>Watchdog timer clock source select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SMCLK</name>
                  <description>SMCLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACLK</name>
                  <description>ACLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLOCLK</name>
                  <description>VLOCLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BCLK</name>
                  <description>BCLK</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDTHOLD</name>
              <description>Watchdog timer hold</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNHOLD</name>
                  <description>Watchdog timer is not stopped</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOLD</name>
                  <description>Watchdog timer is stopped</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDTPW</name>
              <description>Watchdog timer password</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
