EnmanuelParache/msp430fr247x/msp430fr2476.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RTC</name>
      <description>RTC</description>
      <baseAddress>768</baseAddress>
      <registers>
        <register>
          <name>RTCCTL</name>
          <description>RTCCTL0 Register</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>RTCIFG</name>
              <description>Real-time interrupt flag. This bit reports the status of a pending interrupt. This read only bit can be cleared by reading RTCIV register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTCIFG_0</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCIFG_1</name>
                  <description>Interrupt pending</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCIE</name>
              <description>Real-time interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTCIE_0</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCIE_1</name>
                  <description>Interrupt enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCSR</name>
              <description>Real-time software reset. This is a write only bit and is always read with logic 0. 0b = Write 0 has no effect</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTCSR_0</name>
                  <description>Write 0 has no effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCSR_1</name>
                  <description>Write 1 to this bit clears the counter value and reloads the shadow register value from the modulo register at the next tick of the selected source clock. No overflow event or interrupt is generated.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCPS</name>
              <description>Real-time clock pre-divider select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <description>/1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>/10</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>/100</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>/1000</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>/16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <description>/64</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <description>/256</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024</name>
                  <description>/1024</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCSS</name>
              <description>Real-time clock source select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMCLK</name>
                  <description>SMCLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT1CLK</name>
                  <description>XT1CLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLOCLK</name>
                  <description>VLOCLK</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCIV</name>
          <description>Real-Time Clock Interrupt Vector Register</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>RTCIV</name>
              <description>Real-time clock interrupt vector value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCIFG</name>
                  <description>upt Source: RTC Counter Overflow; Interrupt Flag: RTCIFG</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCMOD</name>
          <description>RTC Counter Modulo Register</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>RTCCNT</name>
          <description>RTC Counter Register</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
