EnmanuelParache/msp430fr247x/msp430fr2476.svd
        <register>
          <name>TB0EX0</name>
          <description>Timer_Bx Expansion Register 0</description>
          <addressOffset>32</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>TBIDEX</name>
              <description>Input divider expansion</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <description>Divide by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>Divide by 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>Divide by 3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>Divide by 4</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>Divide by 5</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>Divide by 6</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>Divide by 7</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>Divide by 8</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TB0IV</name>
          <description>Timer_Bx Interrupt Vector Register</description>
          <addressOffset>46</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>TBIV</name>
              <description>Timer_B interrupt vector value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR1</name>
                  <description>Interrupt Source: Capture/compare 1; Interrupt Flag: TBxCCR1 CCIFG; Interrupt Priority: Highest</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR2</name>
                  <description>Interrupt Source: Capture/compare 2; Interrupt Flag: TBxCCR2 CCIFG</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR3</name>
                  <description>Interrupt Source: Capture/compare 3; Interrupt Flag: TBxCCR3 CCIFG</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR4</name>
                  <description>Interrupt Source: Capture/compare 4; Interrupt Flag: TBxCCR4 CCIFG</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR5</name>
                  <description>Interrupt Source: Capture/compare 5; Interrupt Flag: TBxCCR5 CCIFG</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCCR6</name>
                  <description>Interrupt Source: Capture/compare 6; Interrupt Flag: TBxCCR6 CCIFG</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBIFG</name>
                  <description>Interrupt Source: Timer overflow; Interrupt Flag: TBxCTL TBIFG; Interrupt Priority: Lowest</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>MPY32</name>
      <description>MPY32</description>
      <baseAddress>1216</baseAddress>
      <registers>
        <register>
          <name>MPY</name>
          <description>16-bit operand one  multiply</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MPYS</name>
          <description>16-bit operand one  signed multiply</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MAC</name>
          <description>16-bit operand one  multiply accumulate</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MACS</name>
          <description>16-bit operand one  signed multiply accumulate</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>OP2</name>
          <description>16-bit operand two</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>RESLO</name>
          <description>16x16-bit result low word</description>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>RESHI</name>
          <description>16x16-bit result high word</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>SUMEXT</name>
          <description>16x16-bit sum extension register</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MPY32L</name>
          <description>32-bit operand 1  multiply  low word</description>
          <addressOffset>16</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MPY32H</name>
          <description>32-bit operand 1  multiply  high word</description>
          <addressOffset>18</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MPYS32L</name>
          <description>32-bit operand 1  signed multiply  low word</description>
          <addressOffset>20</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MPYS32H</name>
          <description>32-bit operand 1  signed multiply  high word</description>
          <addressOffset>22</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MAC32L</name>
          <description>32-bit operand 1  multiply accumulate  low word</description>
          <addressOffset>24</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MAC32H</name>
          <description>32-bit operand 1  multiply accumulate  high word</description>
          <addressOffset>26</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MACS32L</name>
          <description>32-bit operand 1  signed multiply accumulate  low word</description>
          <addressOffset>28</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MACS32H</name>
          <description>32-bit operand 1  signed multiply accumulate  high word</description>
          <addressOffset>30</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>MACS32H</name>
              <description>32-bit operand 1  signed multiply accumulate  high word</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OP2L</name>
          <description>32-bit operand 2  low word</description>
          <addressOffset>32</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>OP2H</name>
          <description>32-bit operand 2  high word</description>
          <addressOffset>34</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>RES0</name>
          <description>32x32-bit result 0  least significant word</description>
          <addressOffset>36</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>RES1</name>
          <description>32x32-bit result 1</description>
          <addressOffset>38</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>RES2</name>
          <description>32x32-bit result 2</description>
          <addressOffset>40</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>RES3</name>
          <description>32x32-bit result 3  most significant word</description>
          <addressOffset>42</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MPY32CTL0</name>
          <description>MPY32 control register 0</description>
          <addressOffset>44</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>MPYDLY32</name>
              <description>Delayed write mode.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPYDLY32_0</name>
                  <description>Writes are delayed until 64-bit result (RES0 to RES3) is available.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPYDLY32_1</name>
                  <description>Writes are delayed until 32-bit result (RES0 to RES1) is available. 8 MPYDLYWRTEN</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPYDLYWRTEN</name>
              <description>Delayed write enable.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPYDLYWRTEN_0</name>
                  <description>Writes are not delayed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPYDLYWRTEN_1</name>
                  <description>Writes are delayed.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPYOP2_32</name>
              <description>Multiplier bit width of operand 2</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>16</name>
                  <description>16 bits.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>32 bits.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPYOP1_32</name>
              <description>Multiplier bit width of operand 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>16</name>
                  <description>16 bits.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>32 bits.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPYM</name>
              <description>Multiplier mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPY</name>
                  <description>MPY  Multiply</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPYS</name>
                  <description>MPYS  Signed multiply</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAC</name>
                  <description>MAC  Multiply accumulate</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MACS</name>
                  <description>MACS  Signed multiply accumulate</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPYSAT</name>
              <description>Saturation mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Saturation mode disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Saturation mode enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPYFRAC</name>
              <description>Fractional mode.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Fractional mode disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Fractional mode enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPYC</name>
              <description>Carry of the multiplier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPYC_0</name>
                  <description>No carry for result.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPYC_1</name>
                  <description>Result has a carry.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
