EnmanuelParache/msp430fr247x/msp430fr2476.svd
        <register>
          <name>UCA0MCTLW</name>
          <description>eUSCI_Ax Modulation Control Word Register</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UCOS16</name>
              <description>Oversampling mode enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCOS16_0</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCOS16_1</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCBRF</name>
              <description>First modulation stage select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCBRS</name>
              <description>Second modulation stage select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0STATW</name>
          <description>eUSCI_Ax Status Register</description>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UCBUSY</name>
              <description>eUSCI_A busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>eUSCI_A inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>eUSCI_A transmitting or receiving</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCADDR_UCIDLE</name>
              <description>Address received / Idle line detected</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCADDR_UCIDLE_0</name>
                  <description>UCADDR: Received character is data. UCIDLE: No idle line detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCADDR_UCIDLE_1</name>
                  <description>UCADDR: Received character is an address. UCIDLE: Idle line detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCRXERR</name>
              <description>Receive error flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCRXERR_0</name>
                  <description>No receive errors detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCRXERR_1</name>
                  <description>Receive error detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCBRK</name>
              <description>Break detect flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCBRK_0</name>
                  <description>No break condition</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRK_1</name>
                  <description>Break condition occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCPE</name>
              <description>Parity error flag. When UCPEN = 0, UCPE is read as 0. UCPE is cleared when UCAxRXBUF is read.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCPE_0</name>
                  <description>No error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCPE_1</name>
                  <description>Character received with parity error</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCOE</name>
              <description>Overrun error flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCOE_0</name>
                  <description>No error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCOE_1</name>
                  <description>Overrun error occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCFE</name>
              <description>Framing error flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCFE_0</name>
                  <description>No error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCFE_1</name>
                  <description>Character received with low stop bit</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCLISTEN</name>
              <description>Listen enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCLISTEN_0</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCLISTEN_1</name>
                  <description>Enabled. UCAxTXD is internally fed back to the receiver</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0STATW_SPI</name>
          <description>UCA0STATW_SPI</description>
          <alternateRegister>UCA0STATW</alternateRegister>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UCOE</name>
              <description>Overrun error flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCOE_0</name>
                  <description>No error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCOE_1</name>
                  <description>Overrun error occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCFE</name>
              <description>Framing error flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCFE_0</name>
                  <description>No error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCFE_1</name>
                  <description>Bus conflict occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCLISTEN</name>
              <description>Listen enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCLISTEN_0</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCLISTEN_1</name>
                  <description>Enabled. UCAxTXD is internally fed back to the receiver</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCBUSY</name>
              <description>eUSCI_A0 busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>UCBUSY</name>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>eUSCI_A0 inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>eUSCI_A0 transmitting or receiving</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0RXBUF</name>
          <description>eUSCI_Ax Receive Buffer Register</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UCRXBUF</name>
              <description>Receive data buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0RXBUF_SPI</name>
          <description>eUSCI_Ax Receive Buffer Register</description>
          <alternateRegister>UCA0RXBUF</alternateRegister>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UCRXBUF</name>
              <description>Receive data buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0TXBUF</name>
          <description>eUSCI_Ax Transmit Buffer Register</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UCTXBUF</name>
              <description>Transmit data buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0TXBUF_SPI</name>
          <description>eUSCI_Ax Transmit Buffer Register</description>
          <alternateRegister>UCA0TXBUF</alternateRegister>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UCTXBUF</name>
              <description>Transmit data buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0ABCTL</name>
          <description>eUSCI_Ax Auto Baud Rate Control Register</description>
          <addressOffset>16</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UCABDEN</name>
              <description>Automatic baud-rate detect enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCABDEN_0</name>
                  <description>Baud-rate detection disabled. Length of break and synch field is not measured.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCABDEN_1</name>
                  <description>Baud-rate detection enabled. Length of break and synch field is measured and baud-rate settings are changed accordingly.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCBTOE</name>
              <description>Break time out error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCBTOE_0</name>
                  <description>No error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBTOE_1</name>
                  <description>Length of break field exceeded 22 bit times</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCSTOE</name>
              <description>Synch field time out error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCSTOE_0</name>
                  <description>No error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSTOE_1</name>
                  <description>Length of synch field exceeded measurable time</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCDELIM</name>
              <description>Break/synch delimiter length</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCDELIM_0</name>
                  <description>1 bit time</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCDELIM_1</name>
                  <description>2 bit times</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCDELIM_2</name>
                  <description>3 bit times</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCDELIM_3</name>
                  <description>4 bit times</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0IRCTL</name>
          <description>eUSCI_Ax IrDA Control Word Register</description>
          <addressOffset>18</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UCIREN</name>
              <description>IrDA encoder/decoder enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCIREN_0</name>
                  <description>IrDA encoder/decoder disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCIREN_1</name>
                  <description>IrDA encoder/decoder enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCIRTXCLK</name>
              <description>IrDA transmit pulse clock select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCIRTXCLK_0</name>
                  <description>BRCLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCIRTXCLK_1</name>
                  <description>BITCLK16 when UCOS16 = 1. Otherwise, BRCLK.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCIRTXPL</name>
              <description>Transmit pulse length</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCIRRXFE</name>
              <description>IrDA receive filter enabled</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCIRRXFE_0</name>
                  <description>Receive filter disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCIRRXFE_1</name>
                  <description>Receive filter enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCIRRXPL</name>
              <description>IrDA receive input UCAxRXD polarity</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>IrDA transceiver delivers a high pulse when a light pulse is seen</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>IrDA transceiver delivers a low pulse when a light pulse is seen</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCIRRXFL</name>
              <description>Receive filter length</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
