EnmanuelParache/msp430fr247x/msp430fr2476.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>E_USCI_B0</name>
      <description>eUSCI_B0</description>
      <baseAddress>1344</baseAddress>
      <registers>
        <register>
          <name>UCB0CTLW0</name>
          <description>eUSCI_Bx Control Word Register 0</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UCSWRST</name>
              <description>Software reset enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disabled. eUSCI_B reset released for operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enabled. eUSCI_B logic held in reset state</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCTXSTT</name>
              <description>Transmit START condition in master mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCTXSTT_0</name>
                  <description>Do not generate START condition</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXSTT_1</name>
                  <description>Generate START condition</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCTXSTP</name>
              <description>Transmit STOP condition in master mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCTXSTP_0</name>
                  <description>No STOP generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXSTP_1</name>
                  <description>Generate STOP</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCTXNACK</name>
              <description>Transmit a NACK</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCTXNACK_0</name>
                  <description>Acknowledge normally</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXNACK_1</name>
                  <description>Generate NACK</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCTR</name>
              <description>Transmitter/receiver</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX</name>
                  <description>Receiver</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX</name>
                  <description>Transmitter</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCTXACK</name>
              <description>Transmit ACK condition in slave mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCTXACK_0</name>
                  <description>Do not acknowledge the slave address</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCTXACK_1</name>
                  <description>Acknowledge the slave address</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCSSEL</name>
              <description>eUSCI_B clock source select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCLKI</name>
                  <description>UCLKI</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACLK</name>
                  <description>ACLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMCLK</name>
                  <description>SMCLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSSEL_3</name>
                  <description>SMCLK</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCSYNC</name>
              <description>Synchronous mode enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ASYNC</name>
                  <description>Asynchronous mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNC</name>
                  <description>Synchronous mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCMODE</name>
              <description>eUSCI_B mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCMODE_0</name>
                  <description>3-pin SPI</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCMODE_1</name>
                  <description>4-pin SPI (master or slave enabled if STE = 1)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCMODE_2</name>
                  <description>4-pin SPI (master or slave enabled if STE = 0)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCMODE_3</name>
                  <description>I2C mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCMST</name>
              <description>Master mode select</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLAVE</name>
                  <description>Slave mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER</name>
                  <description>Master mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCMM</name>
              <description>Multi-master environment select</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>Single master environment. There is no other master in the system. The address compare unit is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULTI</name>
                  <description>Multi-master environment</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCSLA10</name>
              <description>Slave addressing mode select</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>7BIT</name>
                  <description>Address slave with 7-bit address</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10BIT</name>
                  <description>Address slave with 10-bit address</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCA10</name>
              <description>Own addressing mode select</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCA10_0</name>
                  <description>Own address is a 7-bit address</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCA10_1</name>
                  <description>Own address is a 10-bit address</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UCB0CTLW0_SPI</name>
          <description>eUSCI_Bx Control Word Register 0</description>
          <alternateRegister>UCB0CTLW0</alternateRegister>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UCSWRST</name>
              <description>Software reset enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disabled. eUSCI_B reset released for operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enabled. eUSCI_B logic held in reset state</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCSTEM</name>
              <description>STE mode select in master mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCSTEM_0</name>
                  <description>STE pin is used to prevent conflicts with other masters</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSTEM_1</name>
                  <description>STE pin is used to generate the enable signal for a 4-wire slave</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCSSEL</name>
              <description>eUSCI_B clock source select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCSSEL_0</name>
                  <description>Reserved</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACLK</name>
                  <description>ACLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMCLK</name>
                  <description>SMCLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSSEL_3</name>
                  <description>SMCLK</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCSYNC</name>
              <description>Synchronous mode enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ASYNC</name>
                  <description>Asynchronous mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNC</name>
                  <description>Synchronous mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCMODE</name>
              <description>eUSCI mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCMODE_0</name>
                  <description>3-pin SPI</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCMODE_1</name>
                  <description>4-pin SPI with UCxSTE active high: Slave enabled when UCxSTE = 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCMODE_2</name>
                  <description>4-pin SPI with UCxSTE active low: Slave enabled when UCxSTE = 0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCMODE_3</name>
                  <description>I2C mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCMST</name>
              <description>Master mode select</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLAVE</name>
                  <description>Slave mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER</name>
                  <description>Master mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UC7BIT</name>
              <description>Character length</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8BIT</name>
                  <description>8-bit data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7BIT</name>
                  <description>7-bit data</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCMSB</name>
              <description>MSB first select</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCMSB_0</name>
                  <description>LSB first</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCMSB_1</name>
                  <description>MSB first</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCCKPL</name>
              <description>Clock polarity select</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>The inactive state is low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>The inactive state is high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCCKPH</name>
              <description>Clock phase select</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCCKPH_0</name>
                  <description>Data is changed on the first UCLK edge and captured on the following edge.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCCKPH_1</name>
                  <description>Data is captured on the first UCLK edge and changed on the following edge.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
