EnmanuelParache/msp430fr247x/msp430fr2476.svd
        <register>
          <name>ADCMCTL0</name>
          <description>ADC Conversion Memory Control Register</description>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADCINCH</name>
              <description>Input channel select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCINCH_0</name>
                  <description>A0 - see device-specific data sheet</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINCH_1</name>
                  <description>A1 - see device-specific data sheet</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINCH_2</name>
                  <description>A2 - see device-specific data sheet</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINCH_3</name>
                  <description>A3 - see device-specific data sheet</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINCH_4</name>
                  <description>A4 - see device-specific data sheet</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINCH_5</name>
                  <description>A5 - see device-specific data sheet</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINCH_6</name>
                  <description>A2 - see device-specific data sheet</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINCH_7</name>
                  <description>A7 - see device-specific data sheet</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINCH_8</name>
                  <description>A8 - see device-specific data sheet</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINCH_9</name>
                  <description>A9 - see device-specific data sheet</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINCH_10</name>
                  <description>A10 - see device-specific data sheet</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINCH_11</name>
                  <description>A11 - see device-specific data sheet</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINCH_12</name>
                  <description>A12 - see device-specific data sheet</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINCH_13</name>
                  <description>A13 - see device-specific data sheet</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINCH_14</name>
                  <description>A14 - see device-specific data sheet</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINCH_15</name>
                  <description>A15 - see device-specific data sheet</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCSREF</name>
              <description>Select reference. It is not recommended to change this setting while a conversion is ongoing. Can be modified only when ADCENC = 0. Resetting ADCENC = 0 by software and changing these fields immediately shows an effect when a conversion is active.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCSREF_0</name>
                  <description>000b = V(R+) = AVCC and V(R-) = AVSS</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSREF_1</name>
                  <description>001b = V(R+) = VREF and V(R-) = AVSS</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSREF_2</name>
                  <description>010b = V(R+) = VEREF+ buffered and V(R-) = AVSS</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSREF_3</name>
                  <description>011b =V(R+) = VEREF+ and V(R-) = AVSS</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSREF_4</name>
                  <description>100b = V(R+) = AVCC and V(R-) = VEREF-</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSREF_5</name>
                  <description>101b = V(R+) = VREF and V(R-) = VEREF-</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSREF_6</name>
                  <description>110b = V(R+) = VEREF+ buffered and V(R-) = VEREF-</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSREF_7</name>
                  <description>111b = V(R+) = VEREF+ and V(R-) = VEREF-</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXPCHEN</name>
              <description>ADC input channels expanded</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXPCHEN_0</name>
                  <description>ADC channel expanded disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXPCHEN_1</name>
                  <description>ADC channel expanded enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMEM0</name>
          <description>ADC Conversion Memory Register</description>
          <addressOffset>18</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>ADCIE</name>
          <description>ADC Interrupt Enable 0</description>
          <addressOffset>26</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADCIE0</name>
              <description>Interrupt enable. This bits enable or disable the interrupt request for a completed ADC conversion.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCIE0_0</name>
                  <description>0b = Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCIE0_1</name>
                  <description>1b = Interrupt enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCINIE</name>
              <description>Interrupt enable for the inside of window interrupt of the window comparator.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCINIE_0</name>
                  <description>0b = Inside of window interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINIE_1</name>
                  <description>1b = Inside of window interrupt enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCLOIE</name>
              <description>Interrupt enable for the below lower threshold interrupt of the window comparator.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCLOIE_0</name>
                  <description>0b = Below lower threshold interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCLOIE_1</name>
                  <description>1b = Below lower threshold interrupt enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCHIIE</name>
              <description>Interrupt enable for the above upper threshold interrupt of the window comparator.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCHIIE_0</name>
                  <description>0b = Above upper threshold interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCHIIE_1</name>
                  <description>1b = Above upper threshold interrupt enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCOVIE</name>
              <description>ADCMEM0 overflow interrupt enable.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCOVIE_0</name>
                  <description>0b = Overflow interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCOVIE_1</name>
                  <description>1b = Overflow interrupt enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCTOVIE</name>
              <description>ADC conversion-time-overflow interrupt enable.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCTOVIE_0</name>
                  <description>0b = Conversion time overflow interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCTOVIE_1</name>
                  <description>1b = Conversion time overflow interrupt enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCIFG</name>
          <description>ADC Interrupt Flag</description>
          <addressOffset>28</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADCIFG0</name>
              <description>ADCMEM0 interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCIFG0_0</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCIFG0_1</name>
                  <description>Interrupt pending</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCINIFG</name>
              <description>The ADCINIFG is set when the result of the current ADC conversion is within the thresholds defined by the window comparator threshold registers.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCINIFG_0</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINIFG_1</name>
                  <description>Interrupt pending</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCLOIFG</name>
              <description>The ADCLOIFG is set when the result of the current ADC conversion is below the lower threshold defined by the window comparator lower threshold register.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCLOIFG_0</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCLOIFG_1</name>
                  <description>Interrupt pending</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCHIIFG</name>
              <description>The ADCHIIFG is set when the result of the current ADC conversion is greater than the upper threshold defined by the window comparator upper threshold register.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCHIIFG_0</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCHIIFG_1</name>
                  <description>Interrupt pending</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCOVIFG</name>
              <description>The ADCOVIFG is set when the ADCMEM0 register is written before the last conversion result has been read.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCOVIFG_0</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCOVIFG_1</name>
                  <description>Interrupt pending</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCTOVIFG</name>
              <description>The ADCTOVIFG is set when an ADC conversion is triggered before the actual conversion has completed.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCOVIFG_0</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCTOVIFG_1</name>
                  <description>Interrupt pending</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCIV</name>
          <description>ADC Interrupt Vector</description>
          <addressOffset>30</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADCIV</name>
              <description>interrupt vector value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCOVIFG</name>
                  <description>Interrupt Source: ADCMEM0 overflow; Interrupt Flag: ADCOVIFG; Interrupt Priority: Highest</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCTOVIFG</name>
                  <description>Interrupt Source: Conversion time overflow; Interrupt Flag: ADCTOVIFG</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCHIIFG</name>
                  <description>Interrupt Source: ADCHI Interrupt flag; Interrupt Flag: ADCHIIFG</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCLOIFG</name>
                  <description>Interrupt Source: ADCLO Interrupt flag; Interrupt Flag: ADCLOIFG</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINIFG</name>
                  <description>nterrupt Source: ADCIN Interrupt flag; Interrupt Flag: ADCINIFG</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCIFG0</name>
                  <description>Interrupt Source: ADC memory Interrupt flag; Interrupt Flag: ADCIFG0; Interrupt Priority: Lowest</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
