EnmanuelParache/msp430fr247x/msp430fr2476.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>E_COMP0</name>
      <description>eCOMP0</description>
      <baseAddress>2272</baseAddress>
      <registers>
        <register>
          <name>CP0CTL0</name>
          <description>Comparator Control Register 0</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>CPPEN</name>
              <description>Channel input enable for the V+ terminal</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPPEN_0</name>
                  <description>Selected analog input channel for V+ terminal is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPPEN_1</name>
                  <description>Selected analog input channel for V+ terminal is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPNSEL</name>
              <description>Channel input selected for the - terminal</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPNSEL_0</name>
                  <description>select external input source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPNSEL_1</name>
                  <description>select external input source</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPNSEL_2</name>
                  <description>select external input source</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPNSEL_3</name>
                  <description>select external input source</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPNSEL_4</name>
                  <description>device specific, please refer to device data sheet for details</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPNSEL_5</name>
                  <description>device specific, please refer to device data sheet for details</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPNSEL_6</name>
                  <description>6-bit DAC</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPNSEL_7</name>
                  <description>Reserved</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPNEN</name>
              <description>Channel input enable for the - terminal</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPNEN_0</name>
                  <description>Selected analog input channel for V- terminal is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPNEN_1</name>
                  <description>Selected analog input channel for V- terminal is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPPSEL</name>
              <description>Channel input selected for the V+ terminal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPPSEL_0</name>
                  <description>select external input source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPPSEL_1</name>
                  <description>select external input source</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPPSEL_2</name>
                  <description>select external input source</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPPSEL_3</name>
                  <description>select external input source</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPPSEL_4</name>
                  <description>device specific, please refer to device data sheet for details</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPPSEL_5</name>
                  <description>device specific, please refer to device data sheet for details</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPPSEL_6</name>
                  <description>6-bit DAC</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPPSEL_7</name>
                  <description>Reserved</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CP0CTL1</name>
          <description>Comparator Control Register 1</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>CPOUT</name>
              <description>Comparator output value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPINV</name>
              <description>Comparator output polarity</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPINV_0</name>
                  <description>Comparator output is non-inverted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPINV_1</name>
                  <description>Comparator output is inverted</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPIES</name>
              <description>Interrupt edge select for CEIIFG and CEIFG</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPIES_0</name>
                  <description>Rising edge for CPIFG, falling edge for CPIIFG</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPIES_1</name>
                  <description>Falling edge for CPIFG, rising edge for CPIIFG</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPFLT</name>
              <description>Analog Output Low Pass filter Selection. Changing CPFLT might set interrupt flag.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPFLT_0</name>
                  <description>Comparator output is not filtered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPFLT_1</name>
                  <description>Comparator output is filtered</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPFLTDLY</name>
              <description>Analog Filter Delay selection. These bits are used to select the analog filter delay</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPFLTDLY_0</name>
                  <description>Typical filter delay of 450ns</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPFLTDLY_1</name>
                  <description>Typical filter delay of 900ns</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPFLTDLY_2</name>
                  <description>Typical filter delay of 1800ns</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPFLTDLY_3</name>
                  <description>Typical filter delay of 3600ns</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPMSEL</name>
              <description>Power mode selection.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPMSEL_0</name>
                  <description>High-power &amp; High speed mode (500nA)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPMSEL_1</name>
                  <description>Low-power &amp; Low speed mode (10nA)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPEN</name>
              <description>Comparator enable/disable. This bit is used to disable/enable the comparator. When the comparator is disabled, the Comparator consumes no power.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPEN_0</name>
                  <description>Comparator is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEN_1</name>
                  <description>Comparator is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPHSEL</name>
              <description>Programable Hysteresis mode. These bits are used to select the Hysteresis mode.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPHSEL_0</name>
                  <description>disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPHSEL_1</name>
                  <description>10mV</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPHSEL_2</name>
                  <description>20mV</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPHSEL_3</name>
                  <description>30mV</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPIE</name>
              <description>Comparator interrupt output enable bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPIE_0</name>
                  <description>Interrupt output is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPIE_1</name>
                  <description>Interrupt output is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPIIE</name>
              <description>Comparator inverted interrupt output enable bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPIIE_0</name>
                  <description>Interrupt inverted output is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPIIE_1</name>
                  <description>Interrupt inverted output is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CP0INT</name>
          <description>Comparator Interrupt Control Register</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>CPIFG</name>
              <description>Comparator output interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPIFG_0</name>
                  <description>No interrupt pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPIFG_1</name>
                  <description>Output interrupt pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPIIFG</name>
              <description>Comparator output inverted interrupt flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPIIFG_0</name>
                  <description>No interrupt pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPIIFG_1</name>
                  <description>Output interrupt pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CP0IV</name>
          <description>Comparator Interrupt Vector Word Register</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>CPIV</name>
              <description>Comparator interrupt vector word register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPIFG</name>
                  <description>CPIFG</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPIIFG</name>
                  <description>CPIIFG</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CP0DACCTL</name>
          <description>6-bit Comparator built-in DAC Control Register</description>
          <addressOffset>16</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>CPDACSW</name>
              <description>This bit is only valid when CPDACBUFS is set to 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPDACSW_0</name>
                  <description>CPDACBUF1 selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACSW_1</name>
                  <description>CPDACBUF2 selected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPDACBUFS</name>
              <description>Comparator built-in DAC buffer controlled source selection.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPDACBUFS_0</name>
                  <description>Comparator output is selected as the buffer control source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUFS_1</name>
                  <description>CPDACSW bit is selected as the buffer control source</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPDACREFS</name>
              <description>Comparator built-in DAC reference voltage selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPDACREFS_0</name>
                  <description>VDD selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACREFS_1</name>
                  <description>on-chip VREF selected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPDACEN</name>
              <description>Comparator built-in DAC output control bit.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPDACEN_0</name>
                  <description>DAC output is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACEN_1</name>
                  <description>DAC output is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
