EnmanuelParache/msp430fr247x/msp430fr2476.svd
                  <description>selected reference voltage * 37/64</description>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_38</name>
                  <description>selected reference voltage * 38/64</description>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_39</name>
                  <description>selected reference voltage * 39/64</description>
                  <value>39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_40</name>
                  <description>selected reference voltage * 40/64</description>
                  <value>40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_41</name>
                  <description>selected reference voltage * 41/64</description>
                  <value>41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_42</name>
                  <description>selected reference voltage * 42/64</description>
                  <value>42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_43</name>
                  <description>selected reference voltage * 43/64</description>
                  <value>43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_44</name>
                  <description>selected reference voltage * 44/64</description>
                  <value>44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_45</name>
                  <description>selected reference voltage * 45/64</description>
                  <value>45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_46</name>
                  <description>selected reference voltage * 46/64</description>
                  <value>46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_47</name>
                  <description>selected reference voltage * 47/64</description>
                  <value>47</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_48</name>
                  <description>selected reference voltage * 48/64</description>
                  <value>48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_49</name>
                  <description>selected reference voltage * 49/64</description>
                  <value>49</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_50</name>
                  <description>selected reference voltage * 50/64</description>
                  <value>50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_51</name>
                  <description>selected reference voltage * 51/64</description>
                  <value>51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_52</name>
                  <description>selected reference voltage * 52/64</description>
                  <value>52</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_53</name>
                  <description>selected reference voltage * 53/64</description>
                  <value>53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_54</name>
                  <description>selected reference voltage * 54/64</description>
                  <value>54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_55</name>
                  <description>selected reference voltage * 55/64</description>
                  <value>55</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_56</name>
                  <description>selected reference voltage * 56/64</description>
                  <value>56</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_57</name>
                  <description>selected reference voltage * 57/64</description>
                  <value>57</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_58</name>
                  <description>selected reference voltage * 58/64</description>
                  <value>58</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_59</name>
                  <description>selected reference voltage * 59/64</description>
                  <value>59</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_60</name>
                  <description>selected reference voltage * 60/64</description>
                  <value>60</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_61</name>
                  <description>selected reference voltage * 61/64</description>
                  <value>61</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_62</name>
                  <description>selected reference voltage * 62/64</description>
                  <value>62</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_63</name>
                  <description>selected reference voltage * 63/64</description>
                  <value>63</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
