EnmanuelParache/msp430fr247x/msp430fr2476.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>_INTERRUPTS</name>
      <baseAddress>65408</baseAddress>
      <interrupt>
        <name>ECOMP0</name>
        <description>0xFFCA</description>
        <value>37</value>
      </interrupt>
      <interrupt>
        <name>PORT6</name>
        <description>0xFFCC</description>
        <value>38</value>
      </interrupt>
      <interrupt>
        <name>PORT5</name>
        <description>0xFFCE</description>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>PORT4</name>
        <description>0xFFD0</description>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>PORT3</name>
        <description>0xFFD2</description>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>PORT2</name>
        <description>0xFFD4</description>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>PORT1</name>
        <description>0xFFD6</description>
        <value>43</value>
      </interrupt>
      <interrupt>
        <name>ADC</name>
        <description>0xFFD8</description>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>EUSCI_B1</name>
        <description>0xFFDA</description>
        <value>45</value>
      </interrupt>
      <interrupt>
        <name>EUSCI_B0</name>
        <description>0xFFDC</description>
        <value>46</value>
      </interrupt>
      <interrupt>
        <name>EUSCI_A1</name>
        <description>0xFFDE</description>
        <value>47</value>
      </interrupt>
      <interrupt>
        <name>EUSCI_A0</name>
        <description>0xFFE0</description>
        <value>48</value>
      </interrupt>
      <interrupt>
        <name>WDT</name>
        <description>0xFFE2</description>
        <value>49</value>
      </interrupt>
      <interrupt>
        <name>RTC</name>
        <description>0xFFE4</description>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_B1</name>
        <description>0xFFE6</description>
        <value>51</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_B0</name>
        <description>0xFFE8</description>
        <value>52</value>
      </interrupt>
      <interrupt>
        <name>TIMER3_A1</name>
        <description>0xFFEA</description>
        <value>53</value>
      </interrupt>
      <interrupt>
        <name>TIMER3_A0</name>
        <description>0xFFEC</description>
        <value>54</value>
      </interrupt>
      <interrupt>
        <name>TIMER2_A1</name>
        <description>0xFFEE</description>
        <value>55</value>
      </interrupt>
      <interrupt>
        <name>TIMER2_A0</name>
        <description>0xFFF0</description>
        <value>56</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_A1</name>
        <description>0xFFF2</description>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_A0</name>
        <description>0xFFF4</description>
        <value>58</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_A1</name>
        <description>0xFFF6</description>
        <value>59</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_A0</name>
        <description>0xFFF8</description>
        <value>60</value>
      </interrupt>
      <interrupt>
        <name>UNMI</name>
        <description>0xFFFA</description>
        <value>61</value>
      </interrupt>
      <interrupt>
        <name>SYSNMI</name>
        <description>0xFFFC</description>
        <value>62</value>
      </interrupt>
    </peripheral>
  </peripherals>
</device>